---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReinforcementSettings
source: html/ca904bb8-c5f4-26bb-6220-9f8d5d1ebd1f.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementSettings

Provides access to project-wide reinforcement settings.

## Syntax (C#)
```csharp
public class ReinforcementSettings : Element
```